// Оголошення функції drawTrikuntik з двома параметрами: висота трикутника та символ для малювання
function drawTrikuntik(height, symbol) {
    // Цикл для проходження по рядках трикутника
    for (let i = 1; i <= height; i++) {
        let row = ''; // Змінна для збереження символів в поточному рядку
        // Цикл для додавання символу до рядка row i разів (від 1 до i)
        for (let j = 1; j <= i; j++) {
            row += symbol;
        }
        // Вивід рядка на консоль
        console.log(row);
    }
}

// Виклик функції з висотою 5 і символом '*'
drawTrikuntik(5, '*');