/*1
 JavaScript перетворює числа в рядки, коли вони додаються до String.
 Тому "number" + 3 стає "number3", а потім "number3" + 3 стає "number33" 
*/
console.log('number' + 3 + 3);

/*2
 JavaScript перетворює null в 0 при виконанні математичних операцій.
 результат буде '3' 
*/
console.log(null + 3);

/*3 
 Оператор && повертає перше "false" значення або останнє значення, якщо всі істинні.
 5 - це "true" значення, тому повертається "qwerty".
*/
console.log(5 && "qwerty");

/*4
 Унарний оператор + перетворює string в числа, тому '40' стає 40, а '2' стає 2.
 Але коли число додається до string, число перетворюється назад в string.
 Тому +'40' + +'2' + "hillel" то буде "42hillel" 
 */
console.log(+'40' + +'2' + "hillel");

/*5
 JavaScript перетворює рядки в числа при виконанні математичних операцій, окрім додавання.
 Тому '10' - 5 стає 5. 5 не дорівнює 6, тому результат - false 
 */
console.log('10' - 5 === 6);

/*6
 JavaScript перетворює булеві значення в числа при виконанні математичних операцій: true стає 1, а false стає 0
 тому true + false буде - 1 
 */
console.log(true + false);

/*7
 JavaScript не може перетворити рядок '4px' в число, тому результатом є NaN (Not a Number).
*/
console.log('4px' - 3);

/*8
 JavaScript перетворює string в числа при виконанні математичних операцій, окрім додавання.
 Тому '4' - 3 стає 1.
 '4' - 3; результат буде 1 
*/
console.log('4' - 3);

/*9
 3 ** 0 дорівнює 1, тому '6' + 1 стає '61'.
*/
console.log('6' + 3 ** 0);

/*10
 JavaScript перетворює string в числа при виконанні математичних операцій, окрім додавання.
 Тому 12 / '6' стає 2.
*/
console.log(12 / '6');

/*11
 5 === 6 повертає false. Коли false додається до рядка, воно перетворюється в рядок 'false'.
 Тому '10' + false стає '10false'.
*/
console.log('10' + (5 === 6));

/*12
 Оператор == перевіряє на рівність без перевірки типу, але null тільки рівне самому собі або undefined. 
 Тому null == '' повертає false.
*/
console.log(null == '');

/*13
 9 / 3 дорівнює 3, тому 3 ** 3 дорівнює 27.
*/
console.log(3 ** (9 / 3));

/*14
 Оператор !! перетворює значення в булевий тип. 
 Якщо рядок не порожній, то він є "truthy", тому !!'false' і !!'true' обидва повертають true. 
*/ 
console.log(!!'false' == !!'true');

/*15
 Оператор && має вищий пріоритет, ніж ||, тому спочатку виконується '0' && 1, що повертає 1, оскільки '0' є "truthy".
 Потім виконується 0 || 1, що повертає 1, оскільки 0 є "falsy".
*/
console.log(0 || '0' && 1);

/*16
 +null перетворює null в 0. 0 == false повертає true, оскільки false перетворюється в 0 при порівнянні з числом.
 true < 1 повертає false, оскільки true перетворюється в 1 при порівнянні з числом.
*/
console.log(+null == false) < 1;

/*17
 Оператор && має вищий пріоритет, ніж ||, тому спочатку виконується false && true, що повертає false.
 Потім виконується false || true, що повертає true.
*/
console.log(false && true || true);

/*18
 Оператори в дужках виконуються спочатку, тому спочатку виконується false || true, що повертає true.
 Потім виконується false && true, що повертає false.
*/
console.log(false && (false || true));

/*19
 +null перетворює null в 0. 0 == false повертає true, оскільки false перетворюється в 0 при порівнянні з числом.
 1 ** 5 дорівнює 1, тому true < 1 повертає false, оскільки true перетворюється в 1 при порівнянні з числом.
*/
console.log((+null == false) < 1 ** 5);