// Створюємо об'єкт з властивостями
const myObject = {
    name: 'Dima', // Властивість "name" зі значенням "Dima"
    age: 29, // Властивість "age" зі значенням 29
    occupation: 'QA тестер', // Властивість "occupation" зі значенням "QA тестер"
    
    // Метод, який виводить всі властивості об'єкта
    getInfo() {
      // Проходимося по всіх ключах об'єкта
      for (const key in this) {
        // Перевіряємо, чи властивість не є функцією (методом)
        if (typeof this[key] !== 'function') {
          // Виводимо пару "ключ: значення"
          console.log(`${key}: ${this[key]}`);
        }
      }
    }
  };
  
  // Додаємо нові властивісті
  myObject.height = 'коротун';
  myObject.weight = 'сидяча робота, краще не вказувати';
  
  // Виводимо всі властивості, включаючи щойно додану
  myObject.getInfo();